[{"model": "news.post", "pk": 1, "fields": {"author": 1, "choices": "NW", "datatime_of_creation": "2022-12-20T15:45:40.472Z", "heading": "Когда же роботы будут играть в футбол наравне с людьми?", "text": "Отгремел Чемпионат Мира по футболу 2022 («болели» за Аргентину?) и снова всплыл вопрос, которым задаются многие люди с тех пор, когда первый робот смог пнуть «ногой» по мячу: «Когда же роботы будут играть в футбол наравне с людьми?».", "rating": 0}}, {"model": "news.post", "pk": 9, "fields": {"author": 1, "choices": "NW", "datatime_of_creation": "2022-12-20T15:58:01.484Z", "heading": "Создание онлайн сервера для мобильных многопользовательских, realtime 2D игр (жанра RPG и стратегии) с API на PHP ч. 6", "text": "Правительство РФ анонсировало выделение до $50 млрд для выхода РФ в топ-20 стран—разработчиков Игр к 2030 году. Возможно в скором времени разрабатываемый мной сервис наконец увидит свет", "rating": 0}}, {"model": "news.post", "pk": 10, "fields": {"author": 1, "choices": "NW", "datatime_of_creation": "2022-12-20T15:59:32.917Z", "heading": "Продолжение тестирования i.MX RT на плате MIMXRT1170-EVK", "text": "В прошлой статье было начато тестирование чипов семейства i.MX RT. Здесь продолжаем тестировать.", "rating": 0}}, {"model": "news.post", "pk": 11, "fields": {"author": 1, "choices": "NW", "datatime_of_creation": "2022-12-20T16:00:06.772Z", "heading": "TOTP-аутентификатор на самодельном компьютере", "text": "Здравствуйте, господа программисты и не только. Снова наш веселый Отдел Перспективных Разработок выходит на связь с новой заметкой, посвященной очередной бесполезной, но, интересной для весьма узких кругов теме.", "rating": 0}}, {"model": "news.post", "pk": 12, "fields": {"author": 1, "choices": "NW", "datatime_of_creation": "2022-12-20T16:00:39.122Z", "heading": "Для этого не нужна ARIA", "text": "В веб-разработке написание семантического HTML важно для доступности, а также дает некоторые приятные побочные эффекты, такие как поддержка режима «чтения» в браузере, SEO, graceful degradation и возможность экспорта.", "rating": 0}}, {"model": "news.post", "pk": 13, "fields": {"author": 1, "choices": "NW", "datatime_of_creation": "2022-12-20T16:01:05.623Z", "heading": "Взгляд на современные паттерны интеграции: Enterprise Design Thinking и Event Driven Architecture", "text": "Привет Хабр! Меня зовут Рустем, IBM Senior DevOps Engineer & Integration Architect.  Сегодня я хотел бы взглянуть на современные паттерны интеграции: Enterprise Design Thinking и Event Driven Architecture.  Читать далее", "rating": 0}}, {"model": "news.post", "pk": 14, "fields": {"author": 1, "choices": "NW", "datatime_of_creation": "2022-12-20T16:01:30.718Z", "heading": "38 лучших CI/CD-инструментов в 2022 году", "text": "Непрерывная интеграция (CI) и непрерывная доставка (CD) или CI/CD стали неотъемлемой частью подхода к разработке программного обеспечения и тестирования DevOps. Этот подход дает разработчикам возможность непрерывного развертывания кода. Кроме того, ошибки выявляются на ранней стадии, что позволяет избежать проблем с интеграцией из-за частой фиксации исходного кода.", "rating": 0}}, {"model": "news.post", "pk": 15, "fields": {"author": 1, "choices": "NW", "datatime_of_creation": "2022-12-20T16:02:11.580Z", "heading": "Алгоритмы диапазонов C++20 — 7 немодифицирующих операций", "text": "Библиотека Ranges для C++20 предлагает альтернативы для большинства алгоритмов. На этот раз я хочу показать вам десять немодифицирующих операций. Мы сравним их со «старой» стандартной версией и увидим их преимущества и ограничения.", "rating": 0}}, {"model": "news.post", "pk": 16, "fields": {"author": 1, "choices": "NW", "datatime_of_creation": "2022-12-20T16:02:47.051Z", "heading": "SimpleX – первый мессенджер без идентификаторов пользователей", "text": "Сегодня рассказываем про анонимный мессенджер SimpleX, который написан на Haskell и позволяет, в том числе, использовать сеть Tor для общения.    ​​SimpleX – не только один из немногих мессенджеров, который не", "rating": 0}}, {"model": "news.post", "pk": 17, "fields": {"author": 1, "choices": "NW", "datatime_of_creation": "2022-12-20T16:03:16.361Z", "heading": "10 Онлайн мини-игр прошлой недели, чтобы развлечься #4", "text": "В этом выпуске: защита башен от привидений и рыцарей, шахматные бои, поиск предметов с милыми котиками, платформеры и разнообразные по сложности головоломки. Все игры доступны в онлайне и это подборка с itch.io.", "rating": 0}}, {"model": "news.post", "pk": 18, "fields": {"author": 1, "choices": "NW", "datatime_of_creation": "2022-12-20T16:03:41.216Z", "heading": "Как дизайнить приложения, если ты не дизайнер? Пошаговая инструкция", "text": "Вы когда-нибудь хотели создать приложение, но не знали, с чего начать? Независимо от того, являетесь ли вы предпринимателем, разработчиком, продакт менеджером, или просто любопытным человеком, эта статья покажет вам, как создать дизайн мобильного приложения, даже если у вас нет опыта в дизайне.", "rating": 0}}, {"model": "news.post", "pk": 19, "fields": {"author": 1, "choices": "NW", "datatime_of_creation": "2022-12-20T16:04:44.471Z", "heading": "Борьба с клеветой в интернете: опыт Канады", "text": "Информация, не соответствующая действительности, оценивается по-разному, затрагивает интересы и права разных лиц, включая государство. В зависимости от вредности своего содержания, информация может быть признана клеветой, порочащим материалом или поклепом, в соответствии с законодательством Канады.", "rating": 0}}, {"model": "news.post", "pk": 20, "fields": {"author": 2, "choices": "PR", "datatime_of_creation": "2022-12-20T16:05:23.835Z", "heading": "Исследование: детям не стоит давать гаджеты, чтобы они успокаивались", "text": "Попытки отвлечь детей от истерики экраном планшета или телефона приводят к тому, что ребёнок лишь захочет проводить больше времени с гаджетом, но никак не помогают справиться с проблемой контроля эмоций. Об этом говорится в результатах исследования, опубликованном в журнале JAMA Pediatrics.", "rating": 0}}, {"model": "news.post", "pk": 21, "fields": {"author": 2, "choices": "PR", "datatime_of_creation": "2022-12-20T16:05:58.171Z", "heading": "Физик создал математическую модель путешествий во времени без парадоксов", "text": "Хотя пока ещё никому не удавалось отправиться в прошлое, мы можем рассуждать о возможности такого перемещения и о тех проблемах, которые оно может принести. В частности, одна из проблем с такими путешествиями сформулирована в т.н. «парадоксе дедушки». Если путешественник в прошлое убьёт своего дедушку в молодости (или как-то иначе помешает ему оставить потомство), тогда этот путешественник не должен будет родиться – но тогда кто отправился назад в прошлое и убил дедушку?", "rating": 0}}, {"model": "news.post", "pk": 22, "fields": {"author": 2, "choices": "PR", "datatime_of_creation": "2022-12-20T16:06:34.020Z", "heading": "Предложен универсальный метод повышения стабильности солнечных батарей", "text": "Сотрудники лаборатории новых материалов для солнечной энергетики ФНМ МГУ проводят тестирование долговременной стабильности солнечных элементов. Источник: Алексей Тарасов/МГУ", "rating": 0}}, {"model": "news.post", "pk": 23, "fields": {"author": 2, "choices": "PR", "datatime_of_creation": "2022-12-20T16:07:01.027Z", "heading": "Amazon запустила Prime Gaming в Индии", "text": "Американская компания Amazon запустила игровой сервис Prime Gaming в Индии. Он позволяет получить доступ к ряду видеоигр. Компания начала тестировать сервис на рынках Южной Азии в начале декабря. Индийцы смогут воспользоваться Prime Gaming через несколько недель.", "rating": 0}}, {"model": "news.post", "pk": 24, "fields": {"author": 2, "choices": "PR", "datatime_of_creation": "2022-12-20T16:07:35.130Z", "heading": "НАСА сообщило о низком уровне заряда батарей InSight и опубликовало прощание зонда", "text": "НАСА сообщило об очень низком уровне заряда батарей InSight. Агентство также опубликовало в Twitter последнее фото и трогательное прощание от имени марсианского зонда.", "rating": 0}}, {"model": "news.post", "pk": 25, "fields": {"author": 2, "choices": "PR", "datatime_of_creation": "2022-12-20T16:07:59.056Z", "heading": "В Роскосмосе решают — вернуть международный экипаж с МКС на Землю на резервном корабле или на поврежденном «Союзе МС-22»", "text": "В Роскосмосе до конца декабря решат, как вернуть международный экипаж с МКС на Землю — на резервном корабле «Союз МС-23» или после понимания, что возможно возвращение на «Союзе МС-22» после восстановления работоспособности повреждённой системы.", "rating": 0}}, {"model": "news.post", "pk": 26, "fields": {"author": 2, "choices": "PR", "datatime_of_creation": "2022-12-20T16:08:26.834Z", "heading": "Пока Маск не видит достойных преемников на должность гендира Twitter, журналисты составляют свои списки кандидатов", "text": "После того, как в Twitter закончился опрос, должен ли Илон Маск уходить с поста гендиректора соцсети, медиасообщество пытается представить дальнейшее развитие событий. CNN уже составила список наиболее вероятных претендентов на место Маска, один из добровольцев быстро организовал собственный опрос, а Маск озвучил свою позицию: нет никого, кто и хотел бы, и мог управлять Twitter.", "rating": 0}}, {"model": "news.post", "pk": 27, "fields": {"author": 2, "choices": "PR", "datatime_of_creation": "2022-12-20T16:08:56.038Z", "heading": "Минцифры планирует запустить российский аналог «Википедии» в начале 2023 года", "text": "Запуск портала «Знания», российского аналога «Википедии», намечен на начало 2023 года. Об этом в ходе правительственного часа в Госдуме сообщил глава Минцифры Максут Шадаев.  Читать далее", "rating": 0}}, {"model": "news.post", "pk": 28, "fields": {"author": 2, "choices": "PR", "datatime_of_creation": "2022-12-20T16:09:28.477Z", "heading": "Практикум по nanoCAD BIM ОПС впервые прошел в Красноярске", "text": "«Нанософт разработка» и ее фокус-партнер по направлению «Инженерия», компания «ИнфоИндастри», впервые провели в Красноярске практикум по программному продукту nanoCAD BIM ОПС. Функционал ПО был протестирован на примере реального объекта", "rating": 0}}, {"model": "news.post", "pk": 29, "fields": {"author": 2, "choices": "PR", "datatime_of_creation": "2022-12-20T16:09:54.578Z", "heading": "«Яндекс.Маркет» приступил к продажам телевизоров под собственной маркой Tuvio", "text": "В маркетплейсе «Яндекс.Маркет» запустили продажи электроники и бытовой техники под собственным брендом «Яндекса» Tuvio, рассказали Хабру в пресс-службе компании. Потребители могут оформить заказ на телевизоры Tuvio с 43-дюймовым экраном, до конца года в продажу поступят 32-дюймовые ТВ. В ближайшее время на маркетплейсе начнут реализовывать холодильники, стиральные машины, микроволновые печи и другую домашнюю технику и электронику новых марок «Яндекса».", "rating": 0}}, {"model": "news.post", "pk": 30, "fields": {"author": 2, "choices": "PR", "datatime_of_creation": "2022-12-20T16:10:26.089Z", "heading": "РЖД и «Транстелеком» объединили бесшовным Wi-Fi поезда «Сапсан» и вокзалы Москвы, Санкт-Петербурга и Твери", "text": "ОАО «РЖД» вместе с федеральным оператором связи АО «Компания Транстелеком» организовали бесшовный Wi-Fi на нескольких вокзалах и в поездах «Сапсан». Единая сеть охватывает Московский вокзал в Санкт-Петербурге, Ленинградский – в Москве, вокзалы Тверь и Бологое.", "rating": 0}}, {"model": "news.post", "pk": 31, "fields": {"author": 2, "choices": "PR", "datatime_of_creation": "2022-12-20T16:12:21.953Z", "heading": "Минцифры: около 100 тыс. IT-специалистов покинули РФ в этом году, 80% из них продолжают работать на российские компании", "text": "20 декабря 2022 года глава Минцифры Максут Шадаев сообщил на заседании в Госдуме, что около 100 тыс. российских IT-специалистов покинули страну в этом году.", "rating": 0}}, {"model": "news.post", "pk": 32, "fields": {"author": 2, "choices": "NW", "datatime_of_creation": "2022-12-21T14:45:52.412Z", "heading": "Спрос на продвижение в Telegram значительно вырос на фоне ухода из России иностранных платформ", "text": "Рекламодатели увеличили траты на продвижение в Telegram-каналах — число нативных постов с упоминаниями внешних сайтов увеличилось на 129%, сообщает «Коммерсантъ» со ссылкой на аналитиков SocialJet и TGStat. Общий же рост вложений, по разным оценкам, составляет до 200%", "rating": 0}}, {"model": "news.post", "pk": 33, "fields": {"author": 1, "choices": "NW", "datatime_of_creation": "2022-12-21T14:46:17.156Z", "heading": "«Аэродиск» и AUXO заключили партнёрское соглашение", "text": "IT-компания AUXO и российский разработчик и производитель инновационных решений в области хранения данных и виртуализации «Аэродиск» заключили партнёрское соглашение, рассказали Хабру в пресс-службе AUXO. Партнёрство позволит объединить компетенции «Аэродиск» в области инновационных разработок и опыт AUXO в решении широкого круга IT-задач в госсекторе, промышленном производстве, здравоохранении, телекоме, финансовой сфере и других отраслях. На данном этапе предполагается реализация проектного подхода, где специалисты AUXO будут оценивать возможности использования продуктов вендора по итогам аудита потребностей клиентов.", "rating": 0}}, {"model": "news.post", "pk": 34, "fields": {"author": 1, "choices": "PR", "datatime_of_creation": "2022-12-21T14:48:17.242Z", "heading": "Нельзя просто взять и обезличить данные — опыт команды разработки «Сферы»", "text": "Бизнесу нельзя использовать данные клиентов as is для тестов. Отдел разработки не может просто взять персональные данные (ПДн) и проверить на них новую фичу, обучить Machine Learning-модель. Этот момент регулируют законы и отраслевые стандарты. Чтобы с данными можно было работать, их необходимо обезличить. В крупных компаниях сотни таблиц переплетены идентификаторами, формулами, процедурами. И здесь речь идет уже о формировании обезличенных интеграционных полигонов (комплексов БД). Максим Никитин, тимлид группы разработки, поделится опытом команды разработки платформы производства ПО «Сфера».", "rating": 0}}, {"model": "news.post", "pk": 36, "fields": {"author": 1, "choices": "NW", "datatime_of_creation": "2023-01-09T07:47:44.470Z", "heading": "Изучение TypeScript", "text": "Все привет! Меня зовут Лихопой Кирилл и я - fullstack-разработчик. В заключительной части руководства мы рассмотрим строгий режим и сужение типов в TypeScript. Эти техники позволяют точнее определять типы в коде, чтобы улучшить качество вашего кода и уменьшить количество багов.  Другие части: Часть 1 - Введение и примитивы Часть 2 - Ссылочные типы данных Часть 3 - Классы и интерфейсы Часть 4 - Литералы и дженерики", "rating": 0}}, {"model": "news.post", "pk": 40, "fields": {"author": 2, "choices": "NW", "datatime_of_creation": "2023-01-09T07:59:41.232Z", "heading": "Как я написал книгу по Java", "text": "Буквально недавно книга окончательно вышла, и её можно купить на сайте издательства, а авторские экземпляры получены и хранятся у меня.  Сразу должен сказать, что книга точно не для начинающих. В некоторых главах рассматриваются довольно углублённые технические вопросы, которые новичка скорее запутают, чем облегчат ему освоение программирования. Особое внимание уделено изменениям, которые происходили от версии к версии, а также некоторым внутренним особенностям языка. Из-за длительного периода развития в Java накопилось порядочно «костылей», благодаря которым старый код остаётся работоспособным, но которые могут запутать программиста. В книге описываются основные моменты, которые нужно помнить при разработке, для того чтобы ваш код работал именно так, как вы бы хотели.  Я не особо популярная личность, поэтому не ожидаю какого-либо ажиотажа, но буду стараться, чтобы книгу купило как можно большее количество людей.", "rating": 0}}, {"model": "news.post", "pk": 42, "fields": {"author": 1, "choices": "NW", "datatime_of_creation": "2023-01-10T10:41:01.812Z", "heading": "Apple двукратно нарастила экспорт iPhone из Индии", "text": "В период с апреля по декабрь 2022 года американская компания Apple экспортировала из Индии iPhone на более чем $2,5 млрд, демонстрирует отчёт Bloomberg. Эта сумма почти вдвое превышает показатели экспорта из страны за 2021 год.", "rating": 0}}, {"model": "news.post", "pk": 48, "fields": {"author": 1, "choices": "NW", "datatime_of_creation": "2023-01-10T15:35:39.721Z", "heading": "Vinpower представила зарядную станцию iXcharger GaN 65 Вт с 1TБ памяти для бэкапов", "text": "Vinpower анонсировала зарядную станцию iXcharger со встроенным хранилищем объёмом в 1 ТБ. Во время зарядки устройство делает резервную копию фотографий и видео с iPhone и iPad. Также его можно использовать как обычное внешнее хранилище.", "rating": 0}}, {"model": "news.post", "pk": 73, "fields": {"author": 1, "choices": "NW", "datatime_of_creation": "2023-01-10T16:45:57.110Z", "heading": "Модели управления инфраструктурой", "text": "Управление инфраструктурой даже средней организации является непростой задачей. Большое количество серверов требует постоянного внимания. Установка обновлений и развертывание новых систем все это трудоемкие задачи. Поговорим о том, каким способами можно автоматизировать выполнение данных задач.", "rating": 0}}, {"model": "news.post", "pk": 78, "fields": {"author": 1, "choices": "NW", "datatime_of_creation": "2023-01-11T09:02:59.079Z", "heading": "test", "text": "test 000000000000000000000000000000000000000000000", "rating": 0}}, {"model": "news.post", "pk": 79, "fields": {"author": 2, "choices": "NW", "datatime_of_creation": "2023-01-11T10:39:07.200Z", "heading": "Compliance-дайджест: что изменилось в ИБ-законодательстве в декабре 2022", "text": "На связи Катя из центра «Solar Интеграция» с подборкой новостей из мира комплаенса ИБ за минувший декабрь. Как изменились формы уведомлений в области обработки персональных данных, которые необходимо направлять в Роскомнадзор? Какие новшества появились в области защиты критической информационной инфраструктуры? Что должны уметь ИБ-специалисты в кредитно-финансовой сфере, согласно новому профстандарту? Какие нормативные правовые акты планирует разработать ФСТЭК России в 2023 году? Об этом и не только расскажу в новом выпуске дайджеста.", "rating": 0}}, {"model": "news.post", "pk": 80, "fields": {"author": 2, "choices": "NW", "datatime_of_creation": "2023-01-11T10:41:57.575Z", "heading": "Двухфакторная аутентификация пользователей в Carbonio", "text": "Помимо парольной политики безопасности, о которой мы писали в нашей прошлой статье, и которая может создавать массу неудобств для пользователей и, соответственно, для системных администраторов, к которым эти пользователи обращаются, еще одним способом повысить защищенность учетных записей является двухфакторная аутентификация пользователей. Этот механизм добавляет к необходимости ввода пароля учетной записи необходимость для пользователя вводить временный одноразовый пароль, который случайно генерируется на его устройстве. Такая мера защиты делает практически бесполезным любой брутфорс, а при грамотной настройке может быть совершенно незаметна для пользователей.  Отметим, что 2FA от Carbonio совместима с любыми решениями для генерации одноразовых паролей, в том числе отечественных, а благодаря использованию двухфакторной аутентификации Carbonio достигает 6-го уровня по 8-ми уровневой модели защищенности аутентификации CASMMv5.", "rating": 0}}, {"model": "news.post", "pk": 81, "fields": {"author": 2, "choices": "NW", "datatime_of_creation": "2023-01-11T10:42:51.076Z", "heading": "книг по компьютерному «железу» для новичков и профи", "text": "Привет, Хабр! Мы продолжаем публиковать подборки профессиональной литературы разных направлений для представителей IT-отрасли. Эта статья посвящена компьютерному «железу». В подборке — как относительно базовые книги, так и более продвинутые. Найти что-то полезное для себя в них сможет как человек, который не очень хорошо разбирается в аппаратном обеспечении, так и профессионал, решивший углубить знания или заполнить пробелы. Всё самое интересное — ниже.", "rating": 0}}, {"model": "news.post", "pk": 84, "fields": {"author": 1, "choices": "NW", "datatime_of_creation": "2023-01-11T16:52:11.943Z", "heading": "sfvsdvsv", "text": "fdbdfbdfbdfbdfbdfbdsfbdsbdfb", "rating": 0}}, {"model": "news.post", "pk": 90, "fields": {"author": 1, "choices": "NW", "datatime_of_creation": "2023-01-16T07:07:37.161Z", "heading": "Популяризация JSON-RPC (часть 2)", "text": "Продолжим строить подобие JSON-RPC сервера, начатого в части 1 и анализировать его плюсы и минусы. В прошлой статье был описан механизм отделения бизнес логики бэкенда от транспортного протокола (HTTP) через шаблон проектирования \"Front Controller\", который исполняет в нашем случае JsonRpcController.  Бэкенд API до передачи запроса в код, отвечающий за бизнес логику, обычно предоставляет частичный функционал API шлюза (API gateway) - он может делать аутентификацию, авторизацию, роутинг, валидацию данных, логгирование, кэширование, обеспечивать меры безопасности и другое.", "rating": 0}}, {"model": "news.post", "pk": 91, "fields": {"author": 2, "choices": "NW", "datatime_of_creation": "2023-01-16T07:13:59.527Z", "heading": "Проверка", "text": "Какойто текст 00000000000000000", "rating": 0}}, {"model": "news.post", "pk": 92, "fields": {"author": 1, "choices": "NW", "datatime_of_creation": "2023-01-16T07:18:02.843Z", "heading": "Проверка2", "text": "Проверка дополнительных параметров выполнения", "rating": 0}}, {"model": "news.post", "pk": 93, "fields": {"author": 1, "choices": "NW", "datatime_of_creation": "2023-01-16T07:23:47.748Z", "heading": "Проверка3", "text": "Проверка без expires .000000000", "rating": 0}}, {"model": "news.post", "pk": 94, "fields": {"author": 1, "choices": "NW", "datatime_of_creation": "2023-01-18T04:14:48.502Z", "heading": "Проверка кэширования3", "text": "какой то текст 444444444444444444", "rating": 0}}]